# =============================================================================================
# ~/.Brewfile - Software Installs for MacOS                                                   #
# =============================================================================================
# List of packages to be installed / updated via Homebrew                                     #
# Apps are sorted by category, and arranged alphabetically                                    #
# Be sure to delete / comment out anything you do not need                                    #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile                                   #
# Source GH repository: https://github.com/wilfriedago/Brewfile                               #
# See brew docs for more info: https://docs.brew.sh/Manpage                                   #
# =============================================================================================
# License: MIT © Wilfried AGO 2025 <https://wilfriedago.me>                                 #
# =============================================================================================

# Options
cask_args appdir: '~/Applications', require_sha: true

# =============================================================================================
# Taps
# =============================================================================================
tap 'derailed/k9s' # k9s tap
tap 'hashicorp/tap' # hashicorp tap
tap 'localstack/tap' # localstack tap
tap 'nikitabobko/tap' # aerospace tap
tap 'quarkusio/tap' # quarkus tap

# =============================================================================================
# Apps
# =============================================================================================

cask 'aerospace' # a fast, minimalistic workspace manager for macOS
cask 'alt-tab' # windows alt-tab on macOS
cask 'android-studio' # tools for building Android applications
cask 'chatgpt' # OpenAI's official ChatGPT desktop app
cask 'claude' # Anthropic's official Claude AI desktop app
cask 'claude-code' # Anthropic's CLI for Claude
cask 'copilot-cli' # GitHub Copilot coding agent in your terminal
cask 'discord' # voice and text chat software
cask 'expo-orbit' # launch builds and start simulators from the menu bar
cask 'figma' # collaborative team software
cask 'gitkraken' # Git GUI client
cask 'granola' # AI-powered notepad for meetings
cask 'helium-browser' # Chromium-based web browser
cask 'iina' # free and open-source media player
cask 'intellij-idea' # Java IDE by JetBrains
cask 'mactex-no-gui' # full TeX Live distribution without GUI applications
cask 'megasync' # syncs files between computers and MEGA Cloud drives
cask 'obsidian' # knowledge base that works on top of a local folder of plain text Markdown files
cask 'orbstack' # a modern Docker Desktop alternative for macOS
cask 'paseo' # self-hosted daemon for AI coding agents
cask 'pearcleaner' # a cleaner for macOS
cask 'postman' # collaboration platform for API development
cask 'signal' # instant messaging application focusing on security
cask 'slack' # messaging app
cask 'spotify' # music streaming service
cask 'transmission' # open-source BitTorrent client
cask 'ungoogled-chromium' # Google Chromium, sans integration with Google
cask 'visual-studio-code' # open-source code editor
cask 'warp' # a modern terminal for macOS
cask 'zotero' # collect, organize, cite, and share research sources

# =============================================================================================
# CLI tools
# =============================================================================================

brew 'atuin' # magical shell history backed by SQLite
brew 'bat' # cat with syntax highlighting and Git integration
brew 'btop' # resource monitor that shows usage and stats for processor, memory, disks, network and processes
brew 'cmake' # cross-platform make
brew 'cocoapods' # dependency manager for Cocoa projects
brew 'composer' # dependency manager for PHP
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'direnv' # load/unload environment variables based on $PWD
brew 'dotdrop' # dotfiles manager
brew 'eas-cli' # command-line tool for working with Expo Application Services
brew 'eza' # modern replacement for 'ls'
brew 'fastfetch' # fast system information tool written in Rust, similar to neofetch
brew 'fd' # simple, fast and user-friendly alternative to find
brew 'ffmpeg' # play, record, convert and stream audio and video
brew 'ffuf' # fast web fuzzer written in Go
brew 'flawfinder' # examines code and reports possible security weaknesses
brew 'fzf' # command-line fuzzy finder written in go
brew 'gawk' # GNU awk utility
brew 'gh' # github command-line tool
brew 'git-lfs' # Git extension for versioning large files
brew 'gitleaks' # scan git repos and code for hardcoded secrets
brew 'glab' # open-source GitLab command-line tool
brew 'gnu-sed' # GNU implementation of the famous stream editor
brew 'grep' # GNU grep, egrep and fgrep
brew 'hashicorp/tap/terraform' # infrastructure as code software
brew 'helm' # Kubernetes package manager
brew 'just' # handy command runner for project-specific tasks
brew 'k9s' # kubernetes cli to manage your clusters in style!
brew 'kubernetes-cli' # kubernetes command-line tool
brew 'lizard-analyzer' # extensible Cyclomatic Complexity Analyzer
brew 'localstack-cli' # LocalStack CLI for local AWS cloud emulation
brew 'mas' # Mac App Store command-line interface
brew 'mint' # dependency manager that installs and runs Swift command-line tool packages
brew 'mise' # polyglot runtime manager (replaces fnm, rbenv, pyenv, sdkman, asdf)
brew 'mkcert' # simple tool to make locally trusted development certificates
brew 'mole' # deep clean and optimize your Mac
brew 'mysql' # open source relational database management system
brew 'neovim' # vim-fork focused on extensibility and usability
brew 'nmap' # network exploration tool and security/port scanner
brew 'pandoc' # Swiss-army knife of markup format conversion
brew 'plantuml' # draw UML diagrams
brew 'quarkusio/tap/quarkus' # Quarkus CLI, a Kubernetes-native Java framework tailored for GraalVM and OpenJDK HotSpot
brew 'repomix' # pack your codebase into a single AI-friendly file
brew 'ripgrep' # line-oriented search tool that recursively searches your current directory for a regex pattern
brew 'rtk' # Rust Token Killer, token-optimized CLI proxy
brew 'tectonic' # modernized, complete, self-contained TeX/LaTeX engine
brew 'telnet' # user interface to the TELNET protocol
brew 'tex-fmt' # extremely fast LaTeX formatter written in Rust
brew 'tmux' # terminal multiplexer
brew 'trash' # CLI tool that moves files or folder to the trash
brew 'typst' # markup-based typesetting system
brew 'unar' # command-line unarchiving tools supporting multiple formats
brew 'uv' # extremely fast Python package installer and resolver
brew 'watchman' # watch files and take action when they change
brew 'wget' # Internet file retriever
brew 'witr' # Why is this running?
brew 'yazi' # blazing fast terminal file manager written in Rust, based on async I/O
brew 'yq' # process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'zoxide' # shell extension to navigate your filesystem faster

# =============================================================================================
# VSCode extensions
# =============================================================================================

vscode 'anthropic.claude-code'
vscode 'pkief.material-icon-theme'
vscode 'pkief.material-product-icons'
vscode 'subframe7536.custom-ui-style'

# =============================================================================================
# Mac App Store
# =============================================================================================

mas 'bitwarden', id: 1352778147
mas 'hidden-bar', id: 1452453066
mas 'keynote', id: 361285480
mas 'microsoft-excel', id: 462058435
mas 'microsoft-powerpoint', id: 462062816
mas 'microsoft-word', id: 462054704
mas 'numbers', id: 361304891
mas 'pages', id: 361309726
mas 'reeder', id: 6475002485
mas 'telegram', id: 747648890
mas 'termius', id: 1176074088
mas 'whatsapp', id: 310633997
mas 'xcode', id: 497799835
