# =============================================================================================
# ~/.Brewfile - Software Installs for MacOS                                                   #
# =============================================================================================
# List of packages to be installed / updated via Homebrew                                     #
# Apps are sorted by category, and arranged alphabetically                                    #
# Be sure to delete / comment out anything you do not need                                    #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile                                   #
# Source GH repository: https://github.com/wilfriedago/Brewfile                               #
# See brew docs for more info: https://docs.brew.sh/Manpage                                   #
# =============================================================================================
# License: MIT © Wilfrieds AGO 2025 <https://wilfriedago.me>                                 #
# =============================================================================================

# Options
cask_args appdir: '~/Applications', require_sha: true

# =============================================================================================
# Taps
# =============================================================================================
tap 'atlassian/homebrew-acli' # atlassian tap
tap 'derailed/k9s' # k9s tap
tap 'hashicorp/tap' # hashicorp tap
tap 'localstack/tap' # localstack tap
tap 'nikitabobko/tap' # aerospace tap
tap 'oven-sh/bun' # bun tap
tap 'quarkusio/tap' # quarkus tap
tap 'tw93/tap' # tw93 tap

# =============================================================================================
# Apps
# =============================================================================================

cask 'chatgpt' # OpenAI's official ChatGPT desktop app
cask 'claude' # Anthropic's official Claude AI desktop app
cask 'conductor' # Claude code parallelisation
cask 'discord' # voice and text chat software
cask 'expo-orbit' # launch builds and start simulators from your menu bar
cask 'figma' # collaborative team software
cask 'firefox@developer-edition' # web browser (developer edition)
cask 'folo' # information browser
cask 'ghostty' # a terminal emulator for macOS
cask 'github-copilot-for-xcode' # Xcode extension for GitHub Copilot
cask 'gitkraken' # Git GUI client
cask 'helium-browser' # Chromium-based web browser
cask 'iina' # free and open-source media player
cask 'launchos' # Launchpad alternative
cask 'linear-linear' # app to manage software development and track bugs
cask 'lm-studio' # discover, download, and run local LLMs
cask 'megasync' # syncs files between computers and MEGA Cloud drives
cask 'ngrok' # reverse proxy, secure introspectable tunnels to localhost
cask 'obsidian' # knowledge base that works on top of a local folder of plain text Markdown files
cask 'onlyoffice' # document editor
cask 'orbstack' # a modern Docker Desktop alternative for macOS
cask 'pearcleaner' # a cleaner for macOS
cask 'postman' # collaboration platform for API development
cask 'raycast' # a better Spotlight for macOS
cask 'signal' # instant messaging application focusing on security
cask 'slack' # messaging app
cask 'spotify' # music streaming service
cask 'transmission' # open-source BitTorrent client
cask 'visual-studio-code' # open-source code editor
cask 'warp' # a modern terminal for macOS

# =============================================================================================
# CLI tools
# =============================================================================================

brew 'acli' # atlassian command line interface
brew 'bat' # cat with syntax highlighting and Git integration
brew 'btop' # resource monitor that shows usage and stats for processor, memory, disks, network and processes
brew 'clang-format' # formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew 'cmake' # cross-platform make
brew 'cocoapods' # dependency manager for Cocoa projects
brew 'composer' # dependency manager for PHP
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'cppcheck' # static analysis of C and C++ code
brew 'curl' # get a file from an HTTP, HTTPS or FTP server
brew 'doctl' # DigitalOcean CLI
brew 'dotdrop' # dotfiles manager
brew 'eza' # modern replacement for 'ls'
brew 'fastfetch' # fast system information tool written in Rust, similar to neofetch
brew 'fd' # simple, fast and user-friendly alternative to find
brew 'ffmpeg' # play, record, convert and stream audio and video
brew 'ffuf' # fast web fuzzer written in Go
brew 'flawfinder' # examines code and reports possible security weaknesses
brew 'fnm' # fast and simple Node.js version manager
brew 'fzf' # command-line fuzzy finder written in go
brew 'gawk' # GNU awk utility
brew 'gcc' # gnu compiler collection
brew 'gh' # github command-line tool
brew 'git-cliff' # changelog generator that uses git commit messages to generate the changelog
brew 'git-delta' # syntax-highlighting pager for git and diff output
brew 'git-lfs' # Git extension for versioning large files
brew 'glassfish' # Java EE application server
brew 'gnupg' # GNU Privacy Guard, a free software replacement for Symantec's PGP
brew 'gnu-sed' # GNU implementation of the famous stream editor
brew 'grep' # GNU grep, egrep and fgrep
brew 'hashicorp/tap/terraform' # infrastructure as code software
brew 'helm' # Kubernetes package manager
brew 'jq' # lightweight and flexible command-line json processor
brew 'k6' # modern load testing tool, using Go and JavaScript
brew 'k9s' # kubernetes cli to manage your clusters in style!
brew 'kubernetes-cli' # kubernetes command-line tool
brew 'latexindent' # indentation of LaTeX documents
brew 'lazydocker' # lazier way to manage everything docker
brew 'lazygit' # simple terminal ui for git commands
brew 'lizard-analyzer' # extensible Cyclomatic Complexity Analyzer
brew 'localstack-cli' # LocalStack CLI for local AWS cloud emulation
brew 'mas' # Mac App Store command-line interface
brew 'mint' # dependency manager that installs and runs Swift command-line tool packages
brew 'mkcert' # simple tool to make locally trusted development certificates
brew 'mole' # deep clean and optimize your Mac
brew 'neovim' # vim-fork focused on extensibility and usability
brew 'nikitabobko/tap/aerospace' # a fast, minimalistic workspace manager for macOS
brew 'nmap' # network exploration tool and security/port scanner
brew 'oasdiff' # diff tool for OpenAPI/Swagger files
brew 'oven-sh/bun/bun' # fast all-in-one JavaScript runtime
brew 'pandoc' # Swiss-army knife of markup format conversion
brew 'php' # general-purpose scripting language
brew 'pinentry-mac' # pinentry for GPG on Mac
brew 'pipx' # execute binaries from Python packages in isolated environments
brew 'pyenv' # Python version management
brew 'quarkusio/tap/quarkus' # Quarkus CLI, a Kubernetes-native Java framework tailored for GraalVM and OpenJDK HotSpot
brew 'ripgrep' # line-oriented search tool that recursively searches your current directory for a regex pattern
brew 'starship' # cross-shell prompt for astronauts
brew 'tectonic' # modernized, complete, self-contained TeX/LaTeX engine
brew 'telnet' # user interface to the TELNET protocol
brew 'terragrunt' # thin wrapper for Terraform e.g. for locking state
brew 'tmux' # terminal multiplexer
brew 'trash' # CLI tool that moves files or folder to the trash
brew 'unar' # command-line unarchiving tools supporting multiple formats
brew 'watchman' # watch files and take action when they change
brew 'wget' # Internet file retriever
brew 'yazi' # blazing fast terminal file manager written in Rust, based on async I/O
brew 'yq' # process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'zoxide' # shell extension to navigate your filesystem faster
brew 'zplug' # next-generation plugin manager for zsh

# =============================================================================================
# VSCode extensions
# =============================================================================================

vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'pkief.material-icon-theme'
vscode 'pkief.material-product-icons'
vscode 'subframe7536.custom-ui-style'

# =============================================================================================
# Mac App Store
# =============================================================================================

mas 'bitwarden', id: 1352778147
mas 'goodnotes-2', id: 1444383602
mas 'hidden-bar', id: 1452453066
mas 'termius', id: 1176074088
mas 'whatsapp', id: 310633997
mas 'xcode', id: 497799835
