# =============================================================================================
# ~/.Brewfile - Software Installs for MacOS                                                   #
# =============================================================================================
# List of packages to be installed / updated via Homebrew                                     #
# Apps are sorted by category, and arranged alphabetically                                    #
# Be sure to delete / comment out anything you do not need                                    #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile                                   #
# Source GH repository: https://github.com/wilfriedago/Brewfile                               #
# See brew docs for more info: https://docs.brew.sh/Manpage                                   #
# =============================================================================================
# License: MIT © Wilfrieds AGO 2025 <https://wilfriedago.dev>                                 #
# =============================================================================================

# Options
cask_args appdir: '~/Applications', require_sha: true

# =============================================================================================
# Taps
# =============================================================================================
tap 'homebrew/core' # formulae for the Homebrew package manager
tap 'homebrew/bundle' # bundle command for installing multiple formulae
tap 'homebrew/services' # manage background services with launchctl
tap 'homebrew/cask' # formulae for the Homebrew package manager
tap 'hashicorp/tap' # HashiCorp tap
tap 'tufin/homebrew-tufin' # Tufin tap
tap 'koekeishiya/formulae' # koekeishiya tap
tap 'dotenv-org/brew' # dotenv-org tap
tap 'encoredev/tap' # encoredev tap
tap 'oven-sh/bun' # bun tap

# =============================================================================================
# Fonts
# =============================================================================================

cask 'font-symbols-only-nerd-font' # font with only symbols for developers

# =============================================================================================
# Apps
# =============================================================================================

cask 'basictex' # TeX distribution
cask 'bitwarden' # password manager
cask 'discord' # voice and text chat software
cask 'gitkraken' # Git GUI client
cask 'jetbrains-toolbox' # jetbrains tools manager
cask 'obsidian' # knowledge base that works on top of a local folder of plain text Markdown files
cask 'spotify' # music streaming service
cask 'visual-studio-code' # open-source code editor
cask 'alt-tab' # a better cmd+tab for macOS
cask 'raycast' # a better Spotlight for macOS
cask 'slack' # messaging app
cask 'polypane' # a feature complete browser for web developers for accessibility
cask 'pearcleaner' # a cleaner for macOS
cask 'ghostty' # a terminal emulator for macOS
cask 'docker-desktop' # Docker Desktop for Mac

# =============================================================================================
# QuickLook plugins
# =============================================================================================

cask 'qlmarkdown' # QuickLook generator for Markdown files
cask 'syntax-highlight' # QuickLook generator for source code files with syntax highlighting

# =============================================================================================
# CLI tools
# =============================================================================================

brew 'bat' # cat with syntax highlighting and Git integration
brew 'ffmpeg' # play, record, convert and stream audio and video
brew 'btop' # resource monitor that shows usage and stats for processor, memory, disks, network and processes
brew 'curl' # query HTTP, HTTPS or FTP server
brew 'dotdrop' # dotfiles manager
brew 'dsq' # CLI tool for running SQL queries against JSON, CSV, Excel, Parquet files
brew 'duckdb' # embeddable SQL OLAP Database Management System
brew 'gnupg' # GNU Privacy Guard, a free software replacement for Symantec's PGP
brew 'eza' # modern replacement for 'ls'
brew 'fd' # simple, fast and user-friendly alternative to find
brew 'fzf' # command-line fuzzy finder written in go
brew 'gcc' # gnu compiler collection
brew 'gh' # github command-line tool
brew 'glab' # gitLab command-line tool
brew 'git-delta' # syntax-highlighting pager for git and diff output
brew 'jq' # lightweight and flexible command-line json processor
brew 'skhd' # hotkey daemon for macOS
brew 'navi' # interactive cheatsheet tool for the command-line
brew 'neovim' # vim-fork focused on extensibility and usability
brew 'nmap' # network exploration tool and security/port scanner
brew 'neofetch' # fast, highly customisable system info script
brew 'git-cliff' # changelog generator that uses git commit messages to generate the changelog
brew 'pinentry-mac' # pinentry for GPG on Mac
brew 'lazydocker' # lazier way to manage everything docker
brew 'lazygit' # simple terminal ui for git commands
brew 'kubernetes-cli' # kubernetes command-line tool
brew 'k9s' # kubernetes cli to manage your clusters in style!
brew 'starship' # cross-shell prompt for astronauts
brew 'unar' # command-line unarchiving tools supporting multiple formats
brew 'zoxide' # shell extension to navigate your filesystem faster
brew 'yazi' # blazing fast terminal file manager written in Rust, based on async I/O
brew 'oasdiff' # diff tool for OpenAPI/Swagger files
brew 'doctl' # DigitalOcean CLI
brew 'terraform' # infrastructure as code software
brew 'vault' # secrets management software
brew 'dotenv-vault' # dotenv plugin for HashiCorp Vault
brew 'jadx' # command-line and GUI tools to decompile Android APK files
brew 'encore' # Open Source TypeScript Backend Framework for robust type-safe applications
brew 'fnm' # fast and simple Node.js version manager
brew 'ripgrep' # line-oriented search tool that recursively searches your current directory for a regex pattern
brew 'xh' # friendly and fast replacement for curl
brew 'bun' # fast all-in-one JavaScript runtime

# =============================================================================================
# Linters, formatters and LSPs
# =============================================================================================

brew 'actionlint' # static checker for GitHub Actions workflow files
brew 'ansible-lint' # checks playbooks for practices and behaviour that could potentially be improved
brew 'ansible-language-server' # language server for Ansible files
brew 'bash-language-server' # bash language server that brings an IDE-like experience for bash scripts to most editors
brew 'dotenv-linter' # linter for .env files
brew 'hadolint' # smarter Dockerfile linter to validate best practices
brew 'ltex-ls' # LSP for LanguageTool with support for Latex
brew 'marksman' # Language Server Protocol for Markdown
brew 'shfmt' # autoformat shell script source code
brew 'texlab' # implementation of the Language Server Protocol for LaTeX
brew 'yamlfmt' # extensible command-line tool to format YAML files
brew 'yaml-language-server' # language server for YAML Files
brew 'latexindent' # indentation of LaTeX documentsi

# =============================================================================================
# VSCode extensions
# =============================================================================================

vscode 'alefragnani.project-manager'
vscode 'charliermarsh.ruff'
vscode 'drcika.apc-extension'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'github.vscode-pull-request-github'
vscode 'hbenl.vscode-test-explorer'
vscode 'james-yu.latex-workshop'
vscode 'matangover.mypy'
vscode 'mikestead.dotenv'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-wsl'
vscode 'ms-vscode-remote.vscode-remote-extensionpack'
vscode 'ms-vscode.live-server'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.remote-server'
vscode 'ms-vscode.test-adapter-converter'
vscode 'naumovs.color-highlight'
vscode 'njpwerner.autodocstring'
vscode 'oderwat.indent-rainbow'
vscode 'robertostermann.inline-parameters-extended'
vscode 'rodolphebarbanneau.python-docstring-highlighter'
vscode 'rust-lang.rust-analyzer'
vscode 'swellaby.vscode-rust-test-adapter'
vscode 'tamasfe.even-better-toml'
vscode 'vadimcn.vscode-lldb'
vscode 'visualstudioexptteam.intellicode-api-usage-examples'
vscode 'visualstudioexptteam.vscodeintellicode'
vscode 'visualstudioexptteam.vscodeintellicode-completions'
vscode 'wakatime.vscode-wakatime'
vscode 'yzhang.markdown-all-in-one'

# =============================================================================================
# Mac App Store
# =============================================================================================

mas 'keynote', id: 409183694
mas 'pages', id: 409201541
mas 'numbers', id: 409203825
mas 'hidden-bar', id: 1452453066
mas 'whatsapp', id: 310633997
mas 'telegram', id: 747648890
