[
  "obsidian-excalidraw-plugin",
  "better-word-count",
  "obsidian-linter",
  "obsidian-smart-typography",
  "obsidian-contextual-typography",
  "obsidian-wakatime",
  "rss-reader",
  "obsidian-dictionary-plugin",
  "obsidian-advanced-uri",
  "pieces-for-developers"
]
